/*
 * ------------------------------------------------------------
 * IMPORTANT: The contents of this file are auto-generated.
 *
 * This file may be updated by the Shopify admin theme editor
 * or related systems. Please exercise caution as any changes
 * made to this file may be overwritten.
 * ------------------------------------------------------------
 */
{
  "sections": {
    "main": {
      "type": "main-page",
      "settings": {
        "show_title": true,
        "title": "",
        "padding_top": 36,
        "padding_bottom": 36
      }
    },
    "multirow_fFGqB9": {
      "type": "multirow",
      "blocks": {
        "row_pBJD8A": {
          "type": "row",
          "settings": {
            "image": "shopify://shop_images/DSC_0111.jpg",
            "caption": "Intentional Design",
            "heading": "",
            "text": "<p>Over 20 years in product design have taught us one truth: <em><strong>Quality starts with intentional design</strong></em>.  That's why DOK spends hundreds of hours in our R&D office and on the lake designing, testing, & prototyping every product we make.  We obsess over ramp angles so water exits are seamless, maximize traction so bare feet and paws stay planted, and prototype every handle, D-ring, and corner so everything performs just right.  We run test after test, then invite real familes - and their dogs - to try and break it.  The outcome is gear that let's you swap awkward lifts for effortless memories on the water.</p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "row_WyaaCM": {
          "type": "row",
          "settings": {
            "image": "shopify://shop_images/9fff47003726ff04fbc1521a4c2d7ac6.jpg",
            "caption": "48 Hour Leak Test",
            "heading": "Zero Failure Standard",
            "text": "<p>We bring each inflatable dock and dog ramp up to full pressure and keep an ear out for the tiniest whisper of a leak—day and night—for 48 straight hours. No spot checks, no skipping the line; every single unit does the time. Only when it breezes through that marathon does it earn the DOK smiley. The pay-off: gear that pumps up fast and stays firm from dawn cannonballs to after-dinner float sessions.</p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "row_b9fWEe": {
          "type": "row",
          "settings": {
            "image": "shopify://shop_images/e2eb6d64931e0c32cb5efb756e48085d_c68bbe29-1916-467e-bed8-c18b229b04cc.png",
            "caption": "Double-Layer Sidewalls",
            "heading": "Military Grade PVC",
            "text": "<p>Most brands use one thin sheet of PVC and call it a day. We start with <strong>military-grade PVC, then fuse two layers into double-wall sidewalls.</strong> The result is a shell you can stand on, dance on, even park a pickup on without so much as a quiver. It shrugs off salt spray, dock rash, claws, paws, and every bit of summer chaos—because flimsy gear kills fun faster than you can say “fetch.” When the weekend winds down, it still folds tight and rides home in the trunk. Add an optional four-year manufacturer warranty, and you’ve got rugged confidence that outlasts bargain inflatables by multiple seasons.</p>",
            "button_label": "",
            "button_link": ""
          }
        },
        "row_Heib3i": {
          "type": "row",
          "settings": {
            "image": "shopify://shop_images/d5f04fdaa0a28b930da7c54d744f4a2a.jpg",
            "caption": "Patented DOK-DECK Surface",
            "heading": "",
            "text": "<p>The surface you stand on shouldn’t be an afterthought, so we made it a centerpiece with our <strong>exclusive</strong> <strong>DOK-DECK</strong> <strong>surface</strong>. We start with cushy, marine-grade EVA foam and run it through a CNC mill until the top looks and feels like classic dock planks—grooves for drainage, ridges for grip. That foam then covers the entire deck, leaving zero bare PVC to cause slipping. The traction pattern grips wet paws, sun-lotioned feet, and wriggly kids, turning wipeouts into high-fives. Pigments are infused with UV blockers to keep the deck cool and color-true, even after a string of scorchers. Closed-cell construction means it won’t soak up water or mildew, so it stays fresh season after season. In short, it’s the first inflatable deck built to welcome the whole crew, dawn to dusk.</p>",
            "button_label": "",
            "button_link": ""
          }
        }
      },
      "block_order": [
        "row_pBJD8A",
        "row_WyaaCM",
        "row_b9fWEe",
        "row_Heib3i"
      ],
      "settings": {
        "image_height": "medium",
        "desktop_image_width": "medium",
        "heading_size": "h1",
        "text_style": "body",
        "button_style": "secondary",
        "desktop_content_position": "middle",
        "desktop_content_alignment": "left",
        "image_layout": "alternate-left",
        "section_color_scheme": "",
        "row_color_scheme": "",
        "mobile_content_alignment": "left",
        "padding_top": 36,
        "padding_bottom": 36,
        "alternate_background": true
      }
    }
  },
  "order": [
    "main",
    "multirow_fFGqB9"
  ]
}
